#include "public.h"
#include "map.h"
#include "person.h"
#include <iostream>
#include <string>
#include <Windows.h>

using namespace std;

int main()
{
	const int row = 15;
	const int col = 40;
	int map[row][col] = {
		{ 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 },
		{ 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1 },
		{ 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1 },
		{ 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1 },
		{ 1, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1 },
		{ 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1 },
		{ 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1 },
		{ 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0 },
		{ 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1 },
		{ 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1 },
		{ 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1 },
		{ 1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1 },
		{ 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1 },
		{ 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1 },
		{ 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 },
	};

	// 实例化一个迷宫地图
	// 行，列，墙，路，出口坐标
	MazeMap mp1(row, col, '#', ' ', OUT_X, OUT_Y);
	
	// 根据输入值，设置地图的值
	mp1.setMap(&map[0][0]);

	// 绘制地图
	mp1.drawMap();
	
	// 定义人的字符，程序中会根据人的走向改变字符
	char personChar = '^';  // '^':N  'v':S  '<':E  '>':W
	
	//实例化一个人的类
	MazePerson person1(personChar);
	
	// 人的初始位置
	int posiNow[2] = {1, 9};

	// 检查初始位置是否合法
	bool posiIsOk = person1.setInitPosition(mp1, posiNow[0], posiNow[1]);

	// 人的初始方向 direction1[0]代表前，[1] 后， [2] 左, [3]右
	// NORTH, SOUTH, EAST, WEST 是地图的方向（暂时还不懂枚举）
	int direction1[4] = {NORTH, SOUTH, EAST, WEST};

	// 检查方向设置是否合法
	bool directionIsOk = person1.setInitDirection(&direction1[0]);

	// 设置人的速度
	int speed = FAST;

	// 检查人的速度是否合法
	bool speedIsOk = person1.setSpeed(speed);

	// 如果位置，方向，速度不合法，结束程序
	if (!posiIsOk || !directionIsOk || !speedIsOk) {
		cout << endl;
		cout << "初始化有误" << endl;
		cout << endl;
		system("pause");
		return 0;
	}

	// 绘制人的初始位置
	person1.drawPerson(mp1, posiNow[0], posiNow[1]);

	// 开始走迷宫
	person1.start(mp1);

	person1.gotoXY(0, MAP_ROW_MAX + 4);
	system("pause");
	return 0;
}


